tests/k6_report.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 8 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 8 looping VUs for 30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 1/8 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1/8 VUs  01.0s/30.0s

running (0m02.0s), 1/8 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 1/8 VUs  02.0s/30.0s

running (0m03.0s), 2/8 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 2/8 VUs  03.0s/30.0s

running (0m04.0s), 2/8 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 2/8 VUs  04.0s/30.0s

running (0m05.0s), 2/8 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 2/8 VUs  05.0s/30.0s

running (0m06.0s), 3/8 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 3/8 VUs  06.0s/30.0s

running (0m07.0s), 3/8 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 3/8 VUs  07.0s/30.0s

running (0m08.0s), 3/8 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 3/8 VUs  08.0s/30.0s

running (0m09.0s), 4/8 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 4/8 VUs  09.0s/30.0s

running (0m10.0s), 4/8 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 4/8 VUs  10.0s/30.0s

running (0m11.0s), 4/8 VUs, 1 complete and 0 interrupted iterations
default   [  37% ] 4/8 VUs  11.0s/30.0s

running (0m12.0s), 5/8 VUs, 1 complete and 0 interrupted iterations
default   [  40% ] 5/8 VUs  12.0s/30.0s

running (0m13.0s), 5/8 VUs, 1 complete and 0 interrupted iterations
default   [  43% ] 5/8 VUs  13.0s/30.0s

running (0m14.0s), 5/8 VUs, 1 complete and 0 interrupted iterations
default   [  47% ] 5/8 VUs  14.0s/30.0s

running (0m15.0s), 6/8 VUs, 2 complete and 0 interrupted iterations
default   [  50% ] 6/8 VUs  15.0s/30.0s

running (0m16.0s), 6/8 VUs, 4 complete and 0 interrupted iterations
default   [  53% ] 6/8 VUs  16.0s/30.0s

running (0m17.0s), 6/8 VUs, 6 complete and 0 interrupted iterations
default   [  57% ] 6/8 VUs  17.0s/30.0s

running (0m18.0s), 7/8 VUs, 10 complete and 0 interrupted iterations
default   [  60% ] 7/8 VUs  18.0s/30.0s

running (0m19.0s), 7/8 VUs, 16 complete and 0 interrupted iterations
default   [  63% ] 7/8 VUs  19.0s/30.0s

running (0m20.0s), 7/8 VUs, 23 complete and 0 interrupted iterations
default   [  67% ] 7/8 VUs  20.0s/30.0s

running (0m21.0s), 8/8 VUs, 32 complete and 0 interrupted iterations
default   [  70% ] 8/8 VUs  21.0s/30.0s

running (0m22.0s), 7/8 VUs, 44 complete and 0 interrupted iterations
default   [  73% ] 7/8 VUs  22.0s/30.0s

running (0m23.0s), 6/8 VUs, 54 complete and 0 interrupted iterations
default   [  77% ] 6/8 VUs  23.0s/30.0s

running (0m24.0s), 6/8 VUs, 62 complete and 0 interrupted iterations
default   [  80% ] 6/8 VUs  24.0s/30.0s

running (0m25.0s), 6/8 VUs, 70 complete and 0 interrupted iterations
default   [  83% ] 6/8 VUs  25.0s/30.0s

running (0m26.0s), 6/8 VUs, 78 complete and 0 interrupted iterations
default   [  87% ] 6/8 VUs  26.0s/30.0s

running (0m27.0s), 5/8 VUs, 85 complete and 0 interrupted iterations
default   [  90% ] 5/8 VUs  27.0s/30.0s

running (0m28.0s), 4/8 VUs, 91 complete and 0 interrupted iterations
default   [  93% ] 4/8 VUs  28.0s/30.0s

running (0m29.0s), 3/8 VUs, 95 complete and 0 interrupted iterations
default   [  97% ] 3/8 VUs  29.0s/30.0s

running (0m30.0s), 3/8 VUs, 95 complete and 0 interrupted iterations
default   [ 100% ] 3/8 VUs  30.0s/30.0s

running (0m31.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m32.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m33.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m34.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m35.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m36.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m37.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m38.0s), 2/8 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m39.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m40.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m41.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m42.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m43.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m44.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m45.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m46.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m47.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m48.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m49.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m50.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m51.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m52.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s

running (0m53.0s), 1/8 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 3/8 VUs  30s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=1.03%


  █ TOTAL RESULTS 

    checks_total.......: 486    9.041958/s
    checks_succeeded...: 62.34% 303 out of 486
    checks_failed......: 37.65% 183 out of 486

    ✗ health 200
      ↳  10% — ✓ 10 / ✗ 88
    ✗ generate accepts or rate-limits
      ↳  98% — ✓ 96 / ✗ 1
    ✓ generate returns JSON
    ✗ bad input 400
      ↳  3% — ✓ 3 / ✗ 94
    ✓ not found 404

    CUSTOM
    api_latency....................: avg=866.041577 min=0.554    med=0.671    max=19186.018 p(90)=1.3264   p(95)=9879.0196
    errors.........................: 1.03%   1 out of 97
    rate_limited...................: 100.00% 90 out of 90

    HTTP
    http_req_duration..............: avg=216.78ms   min=456µs    med=689µs    max=19.18s    p(90)=1.41ms   p(95)=1.99ms   
      { expected_response:true }...: avg=4.04s      min=928µs    med=1.21ms   max=12.26s    p(90)=11.53s   p(95)=11.81s   
    http_req_failed................: 95.88%  373 out of 389
    http_reqs......................: 389     7.237288/s

    EXECUTION
    iteration_duration.............: avg=1.37s      min=503.89ms med=504.87ms max=19.69s    p(90)=509.44ms p(95)=10.38s   
    iterations.....................: 97      1.804671/s
    vus............................: 1       min=1          max=8
    vus_max........................: 8       min=8          max=8

    NETWORK
    data_received..................: 540 kB  10 kB/s
    data_sent......................: 56 kB   1.0 kB/s



running (0m53.7s), 0/8 VUs, 97 complete and 1 interrupted iterations
default ✓ [ 100% ] 0/8 VUs  30s